Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData
Struct for passing a command name and additional data.
Remarks:
Matches dotDMParameterData_t on TS Core side,
and also equals the generic Tekla.Structures.DirectManipulation.Adapter.Native.dotParameterData on platform side.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData.Interrupting
A value indicating whether the command is interrupting or transient, according to TS core.
To get whether or not the command is interrupting in the context of DM, call Tekla.Structures.DirectManipulation.Adapter.State.CommandDataParser.IsInterrupting(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData).

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData.Name
The textual identifier of the command.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData.Parameter
The parameter of the command.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData.#ctor(System.String,System.Boolean)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData struct.
name: The name of the command.
interrupting: A value indicating whether the command is interrupting or transient.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData.#ctor(System.String,System.String,System.Boolean)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData struct.
name: The name of the command.
parameter: The parameter of the command.
interrupting: A value indicating whether the command is interrupting or transient.